Repository: vasapolrittideah/optimize
Catalog: modules/core/lib/src/l10n/app_*.arb
Languages: th

# errorBadRequest
source: Invalid request data
th: ข้อมูลคำขอไม่ถูกต้อง

# errorUnauthorized
source: Unauthorized access
th: การเข้าถึงไม่ได้รับอนุญาต

# errorForbidden
source: No permission to access
th: ไม่มีสิทธิ์เข้าถึง

# errorNotFound
source: Resource not found
th: ไม่พบทรัพยากร

# errorConflict
source: Data conflict error
th: ข้อผิดพลาดความขัดแย้งของข้อมูล

# errorUnprocessable
source: Unprocessable entity
th: ไม่สามารถประมวลผลเอนทิตี

# errorTooManyRequests
source: Too many requests
th: ส่งคำขอเกินจำนวนที่กำหนด

# errorInternalServer
source: Internal server error
th: ข้อผิดพลาดของเซิร์ฟเวอร์ภายใน

# errorBadGateway
source: Bad gateway
th: ข้อผิดพลาดเกตเวย์

# errorServiceUnavailable
source: Service unavailable
th: บริการไม่พร้อมใช้งาน

# errorGatewayTimeout
source: Gateway timeout
th: หมดเวลาการเชื่อมต่อเกตเวย์

# errorNoInternetConnection
source: No internet connection
th: ไม่มีการเชื่อมต่ออินเทอร์เน็ต

# errorDataParsing
source: Data parsing error
th: ข้อผิดพลาดการวิเคราะห์ข้อมูล

# errorLocalStorage
source: Local storage error
th: ข้อผิดพลาดที่เก็บข้อมูลภายในเครื่อง

# errorConnectionTimeout
source: Connection timeout
th: หมดเวลาการเชื่อมต่อ

# errorReceiveTimeout
source: Receive timeout
th: หมดเวลาการรับข้อมูล

# errorSendTimeout
source: Send timeout
th: หมดเวลาการส่งข้อมูล

# errorCancelled
source: Request cancelled
th: คำขอถูกยกเลิก

# errorConnectionError
source: Connection error
th: ข้อผิดพลาดการเชื่อมต่อ

# errorUnknown
source: An unexpected error occurred
th: เกิดข้อผิดพลาดที่ไม่คาดคิด

# errorUnknownCode
source: Unexpected server error code: {code}
th: รหัสข้อผิดพลาดของเซิร์ฟเวอร์ที่ไม่คาดคิด: {code}
